Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_sio.h
/*
; RP2350_sio.
; ===========

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_sio equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// SIO address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CPUID;
    volatile    uint32_t    GPIO_IN;
    volatile    uint32_t    GPIO_HI_IN;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    GPIO_OUT;
    volatile    uint32_t    GPIO_HI_OUT;
    volatile    uint32_t    GPIO_OUT_SET;
    volatile    uint32_t    GPIO_HI_OUT_SET;
    volatile    uint32_t    GPIO_OUT_CLR;
    volatile    uint32_t    GPIO_HI_OUT_CLR;
    volatile    uint32_t    GPIO_OUT_XOR;
    volatile    uint32_t    GPIO_HI_OUT_XOR;
    volatile    uint32_t    GPIO_OE;
    volatile    uint32_t    GPIO_HI_OE;
    volatile    uint32_t    GPIO_OE_SET;
    volatile    uint32_t    GPIO_HI_OE_SET;
    volatile    uint32_t    GPIO_OE_CLR;
    volatile    uint32_t    GPIO_HI_OE_CLR;
    volatile    uint32_t    GPIO_OE_XOR;
    volatile    uint32_t    GPIO_HI_OE_XOR;
    volatile    uint32_t    FIFO_ST;
    volatile    uint32_t    FIFO_WR;
    volatile    uint32_t    FIFO_RD;
    volatile    uint32_t    SPINLOCK_ST;
    volatile    uint32_t    RESERVED1[8];
    volatile    uint32_t    INTERP0_ACCUM0;
    volatile    uint32_t    INTERP0_ACCUM1;
    volatile    uint32_t    INTERP0_BASE0;
    volatile    uint32_t    INTERP0_BASE1;
    volatile    uint32_t    INTERP0_BASE2;
    volatile    uint32_t    INTERP0_POP_LANE0;
    volatile    uint32_t    INTERP0_POP_LANE1;
    volatile    uint32_t    INTERP0_POP_FULL;
    volatile    uint32_t    INTERP0_PEEK_LANE0;
    volatile    uint32_t    INTERP0_PEEK_LANE1;
    volatile    uint32_t    INTERP0_PEEK_FULL;
    volatile    uint32_t    INTERP0_CTRL_LANE0;
    volatile    uint32_t    INTERP0_CTRL_LANE1;
    volatile    uint32_t    INTERP0_ACCUM0_ADD;
    volatile    uint32_t    INTERP0_ACCUM1_ADD;
    volatile    uint32_t    INTERP0_BASE_1AND0;
    volatile    uint32_t    INTERP1_ACCUM0;
    volatile    uint32_t    INTERP1_ACCUM1;
    volatile    uint32_t    INTERP1_BASE0;
    volatile    uint32_t    INTERP1_BASE1;
    volatile    uint32_t    INTERP1_BASE2;
    volatile    uint32_t    INTERP1_POP_LANE0;
    volatile    uint32_t    INTERP1_POP_LANE1;
    volatile    uint32_t    INTERP1_POP_FULL;
    volatile    uint32_t    INTERP1_PEEK_LANE0;
    volatile    uint32_t    INTERP1_PEEK_LANE1;
    volatile    uint32_t    INTERP1_PEEK_FULL;
    volatile    uint32_t    INTERP1_CTRL_LANE0;
    volatile    uint32_t    INTERP1_CTRL_LANE1;
    volatile    uint32_t    INTERP1_ACCUM0_ADD;
    volatile    uint32_t    INTERP1_ACCUM1_ADD;
    volatile    uint32_t    INTERP1_BASE_1AND0;
    volatile    uint32_t    SPINLOCK0;
    volatile    uint32_t    SPINLOCK1;
    volatile    uint32_t    SPINLOCK2;
    volatile    uint32_t    SPINLOCK3;
    volatile    uint32_t    SPINLOCK4;
    volatile    uint32_t    SPINLOCK5;
    volatile    uint32_t    SPINLOCK6;
    volatile    uint32_t    SPINLOCK7;
    volatile    uint32_t    SPINLOCK8;
    volatile    uint32_t    SPINLOCK9;
    volatile    uint32_t    SPINLOCK10;
    volatile    uint32_t    SPINLOCK11;
    volatile    uint32_t    SPINLOCK12;
    volatile    uint32_t    SPINLOCK13;
    volatile    uint32_t    SPINLOCK14;
    volatile    uint32_t    SPINLOCK15;
    volatile    uint32_t    SPINLOCK16;
    volatile    uint32_t    SPINLOCK17;
    volatile    uint32_t    SPINLOCK18;
    volatile    uint32_t    SPINLOCK19;
    volatile    uint32_t    SPINLOCK20;
    volatile    uint32_t    SPINLOCK21;
    volatile    uint32_t    SPINLOCK22;
    volatile    uint32_t    SPINLOCK23;
    volatile    uint32_t    SPINLOCK24;
    volatile    uint32_t    SPINLOCK25;
    volatile    uint32_t    SPINLOCK26;
    volatile    uint32_t    SPINLOCK27;
    volatile    uint32_t    SPINLOCK28;
    volatile    uint32_t    SPINLOCK29;
    volatile    uint32_t    SPINLOCK30;
    volatile    uint32_t    SPINLOCK31;
    volatile    uint32_t    DOORBELL_OUT_SET;
    volatile    uint32_t    DOORBELL_OUT_CLR;
    volatile    uint32_t    DOORBELL_IN_SET;
    volatile    uint32_t    DOORBELL_IN_CLR;
    volatile    uint32_t    PERI_NONSEC;
    volatile    uint32_t    RESERVED2[3];
    volatile    uint32_t    RISCV_SOFTIRQ;
    volatile    uint32_t    MTIME_CTRL;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    MTIME;
    volatile    uint32_t    MTIMEH;
    volatile    uint32_t    MTIMECMP;
    volatile    uint32_t    MTIMECMPH;
    volatile    uint32_t    TMDS_CTRL;
    volatile    uint32_t    TMDS_WDATA;
    volatile    uint32_t    TMDS_PEEK_SINGLE;
    volatile    uint32_t    TMDS_POP_SINGLE;
    volatile    uint32_t    TMDS_PEEK_DOUBLE_L0;
    volatile    uint32_t    TMDS_POP_DOUBLE_L0;
    volatile    uint32_t    TMDS_PEEK_DOUBLE_L1;
    volatile    uint32_t    TMDS_POP_DOUBLE_L1;
    volatile    uint32_t    TMDS_PEEK_DOUBLE_L2;
    volatile    uint32_t    TMDS_POP_DOUBLE_L2;
} SIO_TypeDef;

#ifdef __cplusplus
#define SIO_NS  reinterpret_cast<SIO_TypeDef *>(0xD0020000U)
#define SIO_S   reinterpret_cast<SIO_TypeDef *>(0xD0000000U)
#else
#define SIO_NS  ((SIO_TypeDef *)0xD0020000U)
#define SIO_S   ((SIO_TypeDef *)0xD0000000U)
#endif

