Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_sio.h
// CPUID Configuration

#define SIO_CPUID_CPUID                                 (0xFFFFFFFFU<<0)
#define SIO_CPUID_CPUID_0                               (0x1U<<0)

// GPIO_IN Configuration

#define SIO_GPIO_IN_GPIO_IN                             (0xFFFFFFFFU<<0)
#define SIO_GPIO_IN_GPIO_IN_0                           (0x1U<<0)

// GPIO_HI_IN Configuration

#define SIO_GPIO_HI_IN_GPIO                             (0xFFFFU<<0)
#define SIO_GPIO_HI_IN_GPIO_0                           (0x1U<<0)
#define SIO_GPIO_HI_IN_USB_DP                           (0x1U<<24)
#define SIO_GPIO_HI_IN_USB_DM                           (0x1U<<25)
#define SIO_GPIO_HI_IN_QSPI_SCK                         (0x1U<<26)
#define SIO_GPIO_HI_IN_QSPI_CSN                         (0x1U<<27)
#define SIO_GPIO_HI_IN_QSPI_SD                          (0xFU<<28)
#define SIO_GPIO_HI_IN_QSPI_SD_0                        (0x1U<<28)

// GPIO_OUT Configuration

#define SIO_GPIO_OUT_GPIO_OUT                           (0xFFFFFFFFU<<0)
#define SIO_GPIO_OUT_GPIO_OUT_0                         (0x1U<<0)

// GPIO_HI_OUT Configuration

#define SIO_GPIO_HI_OUT_GPIO                            (0xFFFFU<<0)
#define SIO_GPIO_HI_OUT_GPIO_0                          (0x1U<<0)
#define SIO_GPIO_HI_OUT_USB_DP                          (0x1U<<24)
#define SIO_GPIO_HI_OUT_USB_DM                          (0x1U<<25)
#define SIO_GPIO_HI_OUT_QSPI_SCK                        (0x1U<<26)
#define SIO_GPIO_HI_OUT_QSPI_CSN                        (0x1U<<27)
#define SIO_GPIO_HI_OUT_QSPI_SD                         (0xFU<<28)
#define SIO_GPIO_HI_OUT_QSPI_SD_0                       (0x1U<<28)

// GPIO_OUT_SET Configuration

#define SIO_GPIO_OUT_SET_GPIO_OUT_SET                   (0xFFFFFFFFU<<0)
#define SIO_GPIO_OUT_SET_GPIO_OUT_SET_0                 (0x1U<<0)

// GPIO_HI_OUT_SET Configuration

#define SIO_GPIO_HI_OUT_SET_GPIO                        (0xFFFFU<<0)
#define SIO_GPIO_HI_OUT_SET_GPIO_0                      (0x1U<<0)
#define SIO_GPIO_HI_OUT_SET_USB_DP                      (0x1U<<24)
#define SIO_GPIO_HI_OUT_SET_USB_DM                      (0x1U<<25)
#define SIO_GPIO_HI_OUT_SET_QSPI_SCK                    (0x1U<<26)
#define SIO_GPIO_HI_OUT_SET_QSPI_CSN                    (0x1U<<27)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD                     (0xFU<<28)
#define SIO_GPIO_HI_OUT_SET_QSPI_SD_0                   (0x1U<<28)

// GPIO_OUT_CLR Configuration

#define SIO_GPIO_OUT_CLR_GPIO_OUT_CLR                   (0xFFFFFFFFU<<0)
#define SIO_GPIO_OUT_CLR_GPIO_OUT_CLR_0                 (0x1U<<0)

// GPIO_HI_OUT_CLR Configuration

#define SIO_GPIO_HI_OUT_CLR_GPIO                        (0xFFFFU<<0)
#define SIO_GPIO_HI_OUT_CLR_GPIO_0                      (0x1U<<0)
#define SIO_GPIO_HI_OUT_CLR_USB_DP                      (0x1U<<24)
#define SIO_GPIO_HI_OUT_CLR_USB_DM                      (0x1U<<25)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SCK                    (0x1U<<26)
#define SIO_GPIO_HI_OUT_CLR_QSPI_CSN                    (0x1U<<27)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD                     (0xFU<<28)
#define SIO_GPIO_HI_OUT_CLR_QSPI_SD_0                   (0x1U<<28)

// GPIO_OUT_XOR Configuration

#define SIO_GPIO_OUT_XOR_GPIO_OUT_XOR                   (0xFFFFFFFFU<<0)
#define SIO_GPIO_OUT_XOR_GPIO_OUT_XOR_0                 (0x1U<<0)

// GPIO_HI_OUT_XOR Configuration

#define SIO_GPIO_HI_OUT_XOR_GPIO                        (0xFFFFU<<0)
#define SIO_GPIO_HI_OUT_XOR_GPIO_0                      (0x1U<<0)
#define SIO_GPIO_HI_OUT_XOR_USB_DP                      (0x1U<<24)
#define SIO_GPIO_HI_OUT_XOR_USB_DM                      (0x1U<<25)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SCK                    (0x1U<<26)
#define SIO_GPIO_HI_OUT_XOR_QSPI_CSN                    (0x1U<<27)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD                     (0xFU<<28)
#define SIO_GPIO_HI_OUT_XOR_QSPI_SD_0                   (0x1U<<28)

// GPIO_OE Configuration

#define SIO_GPIO_OE_GPIO_OE                             (0xFFFFFFFFU<<0)
#define SIO_GPIO_OE_GPIO_OE_0                           (0x1U<<0)

// GPIO_HI_OE Configuration

#define SIO_GPIO_HI_OE_GPIO                             (0xFFFFU<<0)
#define SIO_GPIO_HI_OE_GPIO_0                           (0x1U<<0)
#define SIO_GPIO_HI_OE_USB_DP                           (0x1U<<24)
#define SIO_GPIO_HI_OE_USB_DM                           (0x1U<<25)
#define SIO_GPIO_HI_OE_QSPI_SCK                         (0x1U<<26)
#define SIO_GPIO_HI_OE_QSPI_CSN                         (0x1U<<27)
#define SIO_GPIO_HI_OE_QSPI_SD                          (0xFU<<28)
#define SIO_GPIO_HI_OE_QSPI_SD_0                        (0x1U<<28)

// GPIO_OE_SET Configuration

#define SIO_GPIO_OE_SET_GPIO_OE_SET                     (0xFFFFFFFFU<<0)
#define SIO_GPIO_OE_SET_GPIO_OE_SET_0                   (0x1U<<0)

// GPIO_HI_OE_SET Configuration

#define SIO_GPIO_HI_OE_SET_GPIO                         (0xFFFFU<<0)
#define SIO_GPIO_HI_OE_SET_GPIO_0                       (0x1U<<0)
#define SIO_GPIO_HI_OE_SET_USB_DP                       (0x1U<<24)
#define SIO_GPIO_HI_OE_SET_USB_DM                       (0x1U<<25)
#define SIO_GPIO_HI_OE_SET_QSPI_SCK                     (0x1U<<26)
#define SIO_GPIO_HI_OE_SET_QSPI_CSN                     (0x1U<<27)
#define SIO_GPIO_HI_OE_SET_QSPI_SD                      (0xFU<<28)
#define SIO_GPIO_HI_OE_SET_QSPI_SD_0                    (0x1U<<28)

// GPIO_OE_CLR Configuration

#define SIO_GPIO_OE_CLR_GPIO_OE_CLR                     (0xFFFFFFFFU<<0)
#define SIO_GPIO_OE_CLR_GPIO_OE_CLR_0                   (0x1U<<0)

// GPIO_HI_OE_CLR Configuration

#define SIO_GPIO_HI_OE_CLR_GPIO                         (0xFFFFU<<0)
#define SIO_GPIO_HI_OE_CLR_GPIO_0                       (0x1U<<0)
#define SIO_GPIO_HI_OE_CLR_USB_DP                       (0x1U<<24)
#define SIO_GPIO_HI_OE_CLR_USB_DM                       (0x1U<<25)
#define SIO_GPIO_HI_OE_CLR_QSPI_SCK                     (0x1U<<26)
#define SIO_GPIO_HI_OE_CLR_QSPI_CSN                     (0x1U<<27)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD                      (0xFU<<28)
#define SIO_GPIO_HI_OE_CLR_QSPI_SD_0                    (0x1U<<28)

// GPIO_OE_XOR Configuration

#define SIO_GPIO_OE_XOR_GPIO_OE_XOR                     (0xFFFFFFFFU<<0)
#define SIO_GPIO_OE_XOR_GPIO_OE_XOR_0                   (0x1U<<0)

// GPIO_HI_OE_XOR Configuration

