Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_sio.h
#define SIO_GPIO_HI_OE_XOR_GPIO                         (0xFFFFU<<0)
#define SIO_GPIO_HI_OE_XOR_GPIO_0                       (0x1U<<0)
#define SIO_GPIO_HI_OE_XOR_USB_DP                       (0x1U<<24)
#define SIO_GPIO_HI_OE_XOR_USB_DM                       (0x1U<<25)
#define SIO_GPIO_HI_OE_XOR_QSPI_SCK                     (0x1U<<26)
#define SIO_GPIO_HI_OE_XOR_QSPI_CSN                     (0x1U<<27)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD                      (0xFU<<28)
#define SIO_GPIO_HI_OE_XOR_QSPI_SD_0                    (0x1U<<28)

// FIFO_ST Configuration

#define SIO_FIFO_ST_VLD                                 (0x1U<<0)
#define SIO_FIFO_ST_RDY                                 (0x1U<<1)
#define SIO_FIFO_ST_WOF                                 (0x1U<<2)
#define SIO_FIFO_ST_ROE                                 (0x1U<<3)

// FIFO_WR Configuration

#define SIO_FIFO_WR_FIFO_WR                             (0xFFFFFFFFU<<0)
#define SIO_FIFO_WR_FIFO_WR_0                           (0x1U<<0)

// FIFO_RD Configuration

#define SIO_FIFO_RD_FIFO_RD                             (0xFFFFFFFFU<<0)
#define SIO_FIFO_RD_FIFO_RD_0                           (0x1U<<0)

// SPINLOCK_ST Configuration

#define SIO_SPINLOCK_ST_SPINLOCK_ST                     (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK_ST_SPINLOCK_ST_0                   (0x1U<<0)

// INTERP0_ACCUM0 Configuration

#define SIO_INTERP0_ACCUM0_INTERP0_ACCUM0               (0xFFFFFFFFU<<0)
#define SIO_INTERP0_ACCUM0_INTERP0_ACCUM0_0             (0x1U<<0)

// INTERP0_ACCUM1 Configuration

#define SIO_INTERP0_ACCUM1_INTERP0_ACCUM1               (0xFFFFFFFFU<<0)
#define SIO_INTERP0_ACCUM1_INTERP0_ACCUM1_0             (0x1U<<0)

// INTERP0_BASE0 Configuration

#define SIO_INTERP0_BASE0_INTERP0_BASE0                 (0xFFFFFFFFU<<0)
#define SIO_INTERP0_BASE0_INTERP0_BASE0_0               (0x1U<<0)

// INTERP0_BASE1 Configuration

#define SIO_INTERP0_BASE1_INTERP0_BASE1                 (0xFFFFFFFFU<<0)
#define SIO_INTERP0_BASE1_INTERP0_BASE1_0               (0x1U<<0)

// INTERP0_BASE2 Configuration

#define SIO_INTERP0_BASE2_INTERP0_BASE2                 (0xFFFFFFFFU<<0)
#define SIO_INTERP0_BASE2_INTERP0_BASE2_0               (0x1U<<0)

// INTERP0_POP_LANE0 Configuration

#define SIO_INTERP0_POP_LANE0_INTERP0_POP_LANE0         (0xFFFFFFFFU<<0)
#define SIO_INTERP0_POP_LANE0_INTERP0_POP_LANE0_0       (0x1U<<0)

// INTERP0_POP_LANE1 Configuration

#define SIO_INTERP0_POP_LANE1_INTERP0_POP_LANE1         (0xFFFFFFFFU<<0)
#define SIO_INTERP0_POP_LANE1_INTERP0_POP_LANE1_0       (0x1U<<0)

// INTERP0_POP_FULL Configuration

#define SIO_INTERP0_POP_FULL_INTERP0_POP_FULL           (0xFFFFFFFFU<<0)
#define SIO_INTERP0_POP_FULL_INTERP0_POP_FULL_0         (0x1U<<0)

// INTERP0_PEEK_LANE0 Configuration

#define SIO_INTERP0_PEEK_LANE0_INTERP0_PEEK_LANE0       (0xFFFFFFFFU<<0)
#define SIO_INTERP0_PEEK_LANE0_INTERP0_PEEK_LANE0_0     (0x1U<<0)

// INTERP0_PEEK_LANE1 Configuration

#define SIO_INTERP0_PEEK_LANE1_INTERP0_PEEK_LANE1       (0xFFFFFFFFU<<0)
#define SIO_INTERP0_PEEK_LANE1_INTERP0_PEEK_LANE1_0     (0x1U<<0)

// INTERP0_PEEK_FULL Configuration

#define SIO_INTERP0_PEEK_FULL_INTERP0_PEEK_FULL         (0xFFFFFFFFU<<0)
#define SIO_INTERP0_PEEK_FULL_INTERP0_PEEK_FULL_0       (0x1U<<0)

// INTERP0_CTRL_LANE0 Configuration

#define SIO_INTERP0_CTRL_LANE0_SHIFT                    (0x1FU<<0)
#define SIO_INTERP0_CTRL_LANE0_SHIFT_0                  (0x1U<<0)
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB                 (0x1FU<<5)
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_0               (0x1U<<5)
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB                 (0x1FU<<10)
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_0               (0x1U<<10)
#define SIO_INTERP0_CTRL_LANE0_SIGNED                   (0x1U<<15)
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT              (0x1U<<16)
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT             (0x1U<<17)
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW                  (0x1U<<18)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB                (0x3U<<19)
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_0              (0x1U<<19)
#define SIO_INTERP0_CTRL_LANE0_BLEND                    (0x1U<<21)
#define SIO_INTERP0_CTRL_LANE0_OVERF0                   (0x1U<<23)
#define SIO_INTERP0_CTRL_LANE0_OVERF1                   (0x1U<<24)
#define SIO_INTERP0_CTRL_LANE0_OVERF                    (0x1U<<25)

// INTERP0_CTRL_LANE1 Configuration

#define SIO_INTERP0_CTRL_LANE1_SHIFT                    (0x1FU<<0)
#define SIO_INTERP0_CTRL_LANE1_SHIFT_0                  (0x1U<<0)
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB                 (0x1FU<<5)
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_0               (0x1U<<5)
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB                 (0x1FU<<10)
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_0               (0x1U<<10)
#define SIO_INTERP0_CTRL_LANE1_SIGNED                   (0x1U<<15)
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT              (0x1U<<16)
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT             (0x1U<<17)
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW                  (0x1U<<18)
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB                (0x3U<<19)
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_0              (0x1U<<19)

// INTERP0_ACCUM0_ADD Configuration

#define SIO_INTERP0_ACCUM0_ADD_INTERP0_ACCUM0_ADD       (0xFFFFFFU<<0)
#define SIO_INTERP0_ACCUM0_ADD_INTERP0_ACCUM0_ADD_0     (0x1U<<0)

// INTERP0_ACCUM1_ADD Configuration

#define SIO_INTERP0_ACCUM1_ADD_INTERP0_ACCUM1_ADD       (0xFFFFFFU<<0)
#define SIO_INTERP0_ACCUM1_ADD_INTERP0_ACCUM1_ADD_0     (0x1U<<0)

// INTERP0_BASE_1AND0 Configuration

#define SIO_INTERP0_BASE_1AND0_INTERP0_BASE_1AND0       (0xFFFFFFFFU<<0)
#define SIO_INTERP0_BASE_1AND0_INTERP0_BASE_1AND0_0     (0x1U<<0)

// INTERP1_ACCUM0 Configuration

#define SIO_INTERP1_ACCUM0_INTERP1_ACCUM0               (0xFFFFFFFFU<<0)
#define SIO_INTERP1_ACCUM0_INTERP1_ACCUM0_0             (0x1U<<0)

// INTERP1_ACCUM1 Configuration

#define SIO_INTERP1_ACCUM1_INTERP1_ACCUM1               (0xFFFFFFFFU<<0)
#define SIO_INTERP1_ACCUM1_INTERP1_ACCUM1_0             (0x1U<<0)

// INTERP1_BASE0 Configuration

#define SIO_INTERP1_BASE0_INTERP1_BASE0                 (0xFFFFFFFFU<<0)
#define SIO_INTERP1_BASE0_INTERP1_BASE0_0               (0x1U<<0)

// INTERP1_BASE1 Configuration

#define SIO_INTERP1_BASE1_INTERP1_BASE1                 (0xFFFFFFFFU<<0)
#define SIO_INTERP1_BASE1_INTERP1_BASE1_0               (0x1U<<0)

// INTERP1_BASE2 Configuration

#define SIO_INTERP1_BASE2_INTERP1_BASE2                 (0xFFFFFFFFU<<0)
#define SIO_INTERP1_BASE2_INTERP1_BASE2_0               (0x1U<<0)

