Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_sio.h
// INTERP1_POP_LANE0 Configuration

#define SIO_INTERP1_POP_LANE0_INTERP1_POP_LANE0         (0xFFFFFFFFU<<0)
#define SIO_INTERP1_POP_LANE0_INTERP1_POP_LANE0_0       (0x1U<<0)

// INTERP1_POP_LANE1 Configuration

#define SIO_INTERP1_POP_LANE1_INTERP1_POP_LANE1         (0xFFFFFFFFU<<0)
#define SIO_INTERP1_POP_LANE1_INTERP1_POP_LANE1_0       (0x1U<<0)

// INTERP1_POP_FULL Configuration

#define SIO_INTERP1_POP_FULL_INTERP1_POP_FULL           (0xFFFFFFFFU<<0)
#define SIO_INTERP1_POP_FULL_INTERP1_POP_FULL_0         (0x1U<<0)

// INTERP1_PEEK_LANE0 Configuration

#define SIO_INTERP1_PEEK_LANE0_INTERP1_PEEK_LANE0       (0xFFFFFFFFU<<0)
#define SIO_INTERP1_PEEK_LANE0_INTERP1_PEEK_LANE0_0     (0x1U<<0)

// INTERP1_PEEK_LANE1 Configuration

#define SIO_INTERP1_PEEK_LANE1_INTERP1_PEEK_LANE1       (0xFFFFFFFFU<<0)
#define SIO_INTERP1_PEEK_LANE1_INTERP1_PEEK_LANE1_0     (0x1U<<0)

// INTERP1_PEEK_FULL Configuration

#define SIO_INTERP1_PEEK_FULL_INTERP1_PEEK_FULL         (0xFFFFFFFFU<<0)
#define SIO_INTERP1_PEEK_FULL_INTERP1_PEEK_FULL_0       (0x1U<<0)

// INTERP1_CTRL_LANE0 Configuration

#define SIO_INTERP1_CTRL_LANE0_SHIFT                    (0x1FU<<0)
#define SIO_INTERP1_CTRL_LANE0_SHIFT_0                  (0x1U<<0)
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB                 (0x1FU<<5)
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_0               (0x1U<<5)
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB                 (0x1FU<<10)
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_0               (0x1U<<10)
#define SIO_INTERP1_CTRL_LANE0_SIGNED                   (0x1U<<15)
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT              (0x1U<<16)
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT             (0x1U<<17)
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW                  (0x1U<<18)
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB                (0x3U<<19)
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_0              (0x1U<<19)
#define SIO_INTERP1_CTRL_LANE0_CLAMP                    (0x1U<<22)
#define SIO_INTERP1_CTRL_LANE0_OVERF0                   (0x1U<<23)
#define SIO_INTERP1_CTRL_LANE0_OVERF1                   (0x1U<<24)
#define SIO_INTERP1_CTRL_LANE0_OVERF                    (0x1U<<25)

// INTERP1_CTRL_LANE1 Configuration

#define SIO_INTERP1_CTRL_LANE1_SHIFT                    (0x1FU<<0)
#define SIO_INTERP1_CTRL_LANE1_SHIFT_0                  (0x1U<<0)
#define SIO_INTERP1_CTRL_LANE1_MASK_LSB                 (0x1FU<<5)
#define SIO_INTERP1_CTRL_LANE1_MASK_LSB_0               (0x1U<<5)
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB                 (0x1FU<<10)
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB_0               (0x1U<<10)
#define SIO_INTERP1_CTRL_LANE1_SIGNED                   (0x1U<<15)
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT              (0x1U<<16)
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT             (0x1U<<17)
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW                  (0x1U<<18)
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB                (0x3U<<19)
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_0              (0x1U<<19)

// INTERP1_ACCUM0_ADD Configuration

#define SIO_INTERP1_ACCUM0_ADD_INTERP1_ACCUM0_ADD       (0xFFFFFFU<<0)
#define SIO_INTERP1_ACCUM0_ADD_INTERP1_ACCUM0_ADD_0     (0x1U<<0)

// INTERP1_ACCUM1_ADD Configuration

#define SIO_INTERP1_ACCUM1_ADD_INTERP1_ACCUM1_ADD       (0xFFFFFFU<<0)
#define SIO_INTERP1_ACCUM1_ADD_INTERP1_ACCUM1_ADD_0     (0x1U<<0)

// INTERP1_BASE_1AND0 Configuration

#define SIO_INTERP1_BASE_1AND0_INTERP1_BASE_1AND0       (0xFFFFFFFFU<<0)
#define SIO_INTERP1_BASE_1AND0_INTERP1_BASE_1AND0_0     (0x1U<<0)

// SPINLOCK0 Configuration

#define SIO_SPINLOCK0_SPINLOCK0                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK0_SPINLOCK0_0                       (0x1U<<0)

// SPINLOCK1 Configuration

#define SIO_SPINLOCK1_SPINLOCK1                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK1_SPINLOCK1_0                       (0x1U<<0)

// SPINLOCK2 Configuration

#define SIO_SPINLOCK2_SPINLOCK2                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK2_SPINLOCK2_0                       (0x1U<<0)

// SPINLOCK3 Configuration

#define SIO_SPINLOCK3_SPINLOCK3                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK3_SPINLOCK3_0                       (0x1U<<0)

// SPINLOCK4 Configuration

#define SIO_SPINLOCK4_SPINLOCK4                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK4_SPINLOCK4_0                       (0x1U<<0)

// SPINLOCK5 Configuration

#define SIO_SPINLOCK5_SPINLOCK5                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK5_SPINLOCK5_0                       (0x1U<<0)

// SPINLOCK6 Configuration

#define SIO_SPINLOCK6_SPINLOCK6                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK6_SPINLOCK6_0                       (0x1U<<0)

// SPINLOCK7 Configuration

#define SIO_SPINLOCK7_SPINLOCK7                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK7_SPINLOCK7_0                       (0x1U<<0)

// SPINLOCK8 Configuration

#define SIO_SPINLOCK8_SPINLOCK8                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK8_SPINLOCK8_0                       (0x1U<<0)

// SPINLOCK9 Configuration

#define SIO_SPINLOCK9_SPINLOCK9                         (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK9_SPINLOCK9_0                       (0x1U<<0)

// SPINLOCK10 Configuration

#define SIO_SPINLOCK10_SPINLOCK10                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK10_SPINLOCK10_0                     (0x1U<<0)

// SPINLOCK11 Configuration

#define SIO_SPINLOCK11_SPINLOCK11                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK11_SPINLOCK11_0                     (0x1U<<0)

// SPINLOCK12 Configuration

#define SIO_SPINLOCK12_SPINLOCK12                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK12_SPINLOCK12_0                     (0x1U<<0)

// SPINLOCK13 Configuration

#define SIO_SPINLOCK13_SPINLOCK13                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK13_SPINLOCK13_0                     (0x1U<<0)

// SPINLOCK14 Configuration

#define SIO_SPINLOCK14_SPINLOCK14                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK14_SPINLOCK14_0                     (0x1U<<0)

// SPINLOCK15 Configuration

#define SIO_SPINLOCK15_SPINLOCK15                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK15_SPINLOCK15_0                     (0x1U<<0)

// SPINLOCK16 Configuration

#define SIO_SPINLOCK16_SPINLOCK16                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK16_SPINLOCK16_0                     (0x1U<<0)

// SPINLOCK17 Configuration

#define SIO_SPINLOCK17_SPINLOCK17                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK17_SPINLOCK17_0                     (0x1U<<0)

// SPINLOCK18 Configuration

#define SIO_SPINLOCK18_SPINLOCK18                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK18_SPINLOCK18_0                     (0x1U<<0)

// SPINLOCK19 Configuration

#define SIO_SPINLOCK19_SPINLOCK19                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK19_SPINLOCK19_0                     (0x1U<<0)

// SPINLOCK20 Configuration

#define SIO_SPINLOCK20_SPINLOCK20                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK20_SPINLOCK20_0                     (0x1U<<0)

// SPINLOCK21 Configuration

#define SIO_SPINLOCK21_SPINLOCK21                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK21_SPINLOCK21_0                     (0x1U<<0)

// SPINLOCK22 Configuration

#define SIO_SPINLOCK22_SPINLOCK22                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK22_SPINLOCK22_0                     (0x1U<<0)

// SPINLOCK23 Configuration

#define SIO_SPINLOCK23_SPINLOCK23                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK23_SPINLOCK23_0                     (0x1U<<0)

// SPINLOCK24 Configuration

#define SIO_SPINLOCK24_SPINLOCK24                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK24_SPINLOCK24_0                     (0x1U<<0)

// SPINLOCK25 Configuration

#define SIO_SPINLOCK25_SPINLOCK25                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK25_SPINLOCK25_0                     (0x1U<<0)

