Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_sio.h
// SPINLOCK26 Configuration

#define SIO_SPINLOCK26_SPINLOCK26                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK26_SPINLOCK26_0                     (0x1U<<0)

// SPINLOCK27 Configuration

#define SIO_SPINLOCK27_SPINLOCK27                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK27_SPINLOCK27_0                     (0x1U<<0)

// SPINLOCK28 Configuration

#define SIO_SPINLOCK28_SPINLOCK28                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK28_SPINLOCK28_0                     (0x1U<<0)

// SPINLOCK29 Configuration

#define SIO_SPINLOCK29_SPINLOCK29                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK29_SPINLOCK29_0                     (0x1U<<0)

// SPINLOCK30 Configuration

#define SIO_SPINLOCK30_SPINLOCK30                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK30_SPINLOCK30_0                     (0x1U<<0)

// SPINLOCK31 Configuration

#define SIO_SPINLOCK31_SPINLOCK31                       (0xFFFFFFFFU<<0)
#define SIO_SPINLOCK31_SPINLOCK31_0                     (0x1U<<0)

// DOORBELL_OUT_SET Configuration

#define SIO_DOORBELL_OUT_SET_DOORBELL_OUT_SET           (0xFFU<<0)
#define SIO_DOORBELL_OUT_SET_DOORBELL_OUT_SET_0         (0x1U<<0)

// DOORBELL_OUT_CLR Configuration

#define SIO_DOORBELL_OUT_CLR_DOORBELL_OUT_CLR           (0xFFU<<0)
#define SIO_DOORBELL_OUT_CLR_DOORBELL_OUT_CLR_0         (0x1U<<0)

// DOORBELL_IN_SET Configuration

#define SIO_DOORBELL_IN_SET_DOORBELL_IN_SET             (0xFFU<<0)
#define SIO_DOORBELL_IN_SET_DOORBELL_IN_SET_0           (0x1U<<0)

// DOORBELL_IN_CLR Configuration

#define SIO_DOORBELL_IN_CLR_DOORBELL_IN_CLR             (0xFFU<<0)
#define SIO_DOORBELL_IN_CLR_DOORBELL_IN_CLR_0           (0x1U<<0)

// PERI_NONSEC Configuration

#define SIO_PERI_NONSEC_INTERP0                         (0x1U<<0)
#define SIO_PERI_NONSEC_INTERP1                         (0x1U<<1)
#define SIO_PERI_NONSEC_TMDS                            (0x1U<<5)

// RISCV_SOFTIRQ Configuration

#define SIO_RISCV_SOFTIRQ_CORE0_SET                     (0x1U<<0)
#define SIO_RISCV_SOFTIRQ_CORE1_SET                     (0x1U<<1)
#define SIO_RISCV_SOFTIRQ_CORE0_CLR                     (0x1U<<8)
#define SIO_RISCV_SOFTIRQ_CORE1_CLR                     (0x1U<<9)

// MTIME_CTRL Configuration

#define SIO_MTIME_CTRL_EN                               (0x1U<<0)
#define SIO_MTIME_CTRL_FULLSPEED                        (0x1U<<1)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE0                   (0x1U<<2)
#define SIO_MTIME_CTRL_DBGPAUSE_CORE1                   (0x1U<<3)

// MTIME Configuration

#define SIO_MTIME_MTIME                                 (0xFFFFFFFFU<<0)
#define SIO_MTIME_MTIME_0                               (0x1U<<0)

// MTIMEH Configuration

#define SIO_MTIMEH_MTIMEH                               (0xFFFFFFFFU<<0)
#define SIO_MTIMEH_MTIMEH_0                             (0x1U<<0)

// MTIMECMP Configuration

#define SIO_MTIMECMP_MTIMECMP                           (0xFFFFFFFFU<<0)
#define SIO_MTIMECMP_MTIMECMP_0                         (0x1U<<0)

// MTIMECMPH Configuration

#define SIO_MTIMECMPH_MTIMECMPH                         (0xFFFFFFFFU<<0)
#define SIO_MTIMECMPH_MTIMECMPH_0                       (0x1U<<0)

// TMDS_CTRL Configuration

#define SIO_TMDS_CTRL_L0_ROT                            (0xFU<<0)
#define SIO_TMDS_CTRL_L0_ROT_0                          (0x1U<<0)
#define SIO_TMDS_CTRL_L1_ROT                            (0xFU<<4)
#define SIO_TMDS_CTRL_L1_ROT_0                          (0x1U<<4)
#define SIO_TMDS_CTRL_L2_ROT                            (0xFU<<8)
#define SIO_TMDS_CTRL_L2_ROT_0                          (0x1U<<8)
#define SIO_TMDS_CTRL_L0_NBITS                          (0x7U<<12)
#define SIO_TMDS_CTRL_L0_NBITS_0                        (0x1U<<12)
#define SIO_TMDS_CTRL_L1_NBITS                          (0x7U<<15)
#define SIO_TMDS_CTRL_L1_NBITS_0                        (0x1U<<15)
#define SIO_TMDS_CTRL_L2_NBITS                          (0x7U<<18)
#define SIO_TMDS_CTRL_L2_NBITS_0                        (0x1U<<18)
#define SIO_TMDS_CTRL_INTERLEAVE                        (0x1U<<23)
#define SIO_TMDS_CTRL_PIX_SHIFT                         (0x7U<<24)
#define SIO_TMDS_CTRL_PIX2_NOSHIFT                      (0x1U<<27)
#define SIO_TMDS_CTRL_CLEAR_BALANCE                     (0x1U<<28)
#define SIO_TMDS_CTRL_PIX_SHIFT_0                       (0x0U<<24)
#define SIO_TMDS_CTRL_PIX_SHIFT_1                       (0x1U<<24)
#define SIO_TMDS_CTRL_PIX_SHIFT_2                       (0x2U<<24)
#define SIO_TMDS_CTRL_PIX_SHIFT_4                       (0x3U<<24)
#define SIO_TMDS_CTRL_PIX_SHIFT_8                       (0x4U<<24)
#define SIO_TMDS_CTRL_PIX_SHIFT_16                      (0x5U<<24)

// TMDS_WDATA Configuration

#define SIO_TMDS_WDATA_TMDS_WDATA                       (0xFFFFFFFFU<<0)
#define SIO_TMDS_WDATA_TMDS_WDATA_0                     (0x1U<<0)

// TMDS_PEEK_SINGLE Configuration

#define SIO_TMDS_PEEK_SINGLE_TMDS_PEEK_SINGLE           (0xFFFFFFFFU<<0)
#define SIO_TMDS_PEEK_SINGLE_TMDS_PEEK_SINGLE_0         (0x1U<<0)

// TMDS_POP_SINGLE Configuration

#define SIO_TMDS_POP_SINGLE_TMDS_POP_SINGLE             (0xFFFFFFFFU<<0)
#define SIO_TMDS_POP_SINGLE_TMDS_POP_SINGLE_0           (0x1U<<0)

// TMDS_PEEK_DOUBLE_L0 Configuration

#define SIO_TMDS_PEEK_DOUBLE_L0_TMDS_PEEK_DOUBLE_L0     (0xFFFFFFFFU<<0)
#define SIO_TMDS_PEEK_DOUBLE_L0_TMDS_PEEK_DOUBLE_L0_0   (0x1U<<0)

// TMDS_POP_DOUBLE_L0 Configuration

#define SIO_TMDS_POP_DOUBLE_L0_TMDS_POP_DOUBLE_L0       (0xFFFFFFFFU<<0)
#define SIO_TMDS_POP_DOUBLE_L0_TMDS_POP_DOUBLE_L0_0     (0x1U<<0)

// TMDS_PEEK_DOUBLE_L1 Configuration

#define SIO_TMDS_PEEK_DOUBLE_L1_TMDS_PEEK_DOUBLE_L1     (0xFFFFFFFFU<<0)
#define SIO_TMDS_PEEK_DOUBLE_L1_TMDS_PEEK_DOUBLE_L1_0   (0x1U<<0)

// TMDS_POP_DOUBLE_L1 Configuration

#define SIO_TMDS_POP_DOUBLE_L1_TMDS_POP_DOUBLE_L1       (0xFFFFFFFFU<<0)
#define SIO_TMDS_POP_DOUBLE_L1_TMDS_POP_DOUBLE_L1_0     (0x1U<<0)

// TMDS_PEEK_DOUBLE_L2 Configuration

#define SIO_TMDS_PEEK_DOUBLE_L2_TMDS_PEEK_DOUBLE_L2     (0xFFFFFFFFU<<0)
#define SIO_TMDS_PEEK_DOUBLE_L2_TMDS_PEEK_DOUBLE_L2_0   (0x1U<<0)

// TMDS_POP_DOUBLE_L2 Configuration

#define SIO_TMDS_POP_DOUBLE_L2_TMDS_POP_DOUBLE_L2       (0xFFFFFFFFU<<0)
#define SIO_TMDS_POP_DOUBLE_L2_TMDS_POP_DOUBLE_L2_0     (0x1U<<0)
